In [0]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [34]:
salary_data = pd.read_csv('Salaries.csv' ,na_values='Not Provided')

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [35]:
salary_data.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [36]:
salary_data.isnull().sum()

Id                       0
EmployeeName             2
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [37]:
salary_data.describe()

                  Id        BasePay  ...           Year  Notes
count  148654.000000  148045.000000  ...  148654.000000    0.0
mean    74327.500000   66325.448841  ...    2012.522643    NaN
std     42912.857795   42764.635495  ...       1.117538    NaN
min         1.000000    -166.010000  ...    2011.000000    NaN
25%     37164.250000   33588.200000  ...    2012.000000    NaN
50%     74327.500000   65007.450000  ...    2013.000000    NaN
75%    111490.750000   94691.050000  ...    2014.000000    NaN
max    148654.000000  319275.010000  ...    2014.000000    NaN

[8 rows x 9 columns]

In [38]:
# Name of highest paid person (including benefits)?
data = salary_data['TotalPayBenefits'].idxmax()
salary_data.loc[data]['EmployeeName']

'NATHANIEL FORD'

In [39]:
# Name of lowest paid person (including benefits)?
data1 = salary_data['TotalPayBenefits'].idxmin()
salary_data.loc[data1]['EmployeeName']

'Joe Lopez'

In [47]:
salary_data['OvertimePay'].max()

245131.88

In [40]:
# Average (mean) BasePay of all employees per year? (2011-2014) ?
salary_data.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [42]:
# Unique Job Titles
salary_data['JobTitle'].nunique()

2159

In [43]:
# What are the top 5 most common jobs? 
salary_data['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [44]:
# How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)
(salary_data[salary_data['Year']==2013]['JobTitle'].value_counts()==1).sum()

202